<template><div><h1 id="引言" tabindex="-1"><a class="header-anchor" href="#引言"><span>引言</span></a></h1>
<p>大学时，我开始使用金山快盘，这款同步网盘可以在电脑、平板、手机上共享文件，省去了U盘跨设备传输的麻烦，很实用。但由于经营问题，金山快盘于2016年关闭。此时我的数字资料已累计80多GB，于是转移到强调数据加密的Mega，开通了年费会员。然而，2017年起，访问Mega变得困难，我逐渐放弃了它。</p>
<p>其他网盘如Dropbox、OneDrive和百度网盘，要么需要科学上网，要么体验差、隐私无法保证。于是，我萌生了自建网盘的想法，开始了self-host的折腾之路。</p>
<p>2018年，我第一次尝试自建网盘。当时，用一台旧的联想笔记本电脑搭建了NextCloud，并借助nat123实现内网穿透，这标志着我的self-host旅程的开始。这种从零搭建的经历让我对家庭云服务的可能性充满了热情和期待。</p>
<p>到今天，家庭云服务的生态已变得相当丰富，从iStore、飞牛OS到各种NAS解决方案，为用户提供了开箱即用的便利，利用这些软件工具，不仅可以搭建云盘，还可以搭建像芒果TV一样的视频网站，像Notion一样的笔记软件，像小米智能家居一样的控制中心。然而，对于喜欢折腾的电脑爱好者而言，这些成熟方案在一定程度上削弱了探索和动手的乐趣。正如小时候拆开闹钟再装回去的成就感，从零开始构建属于自己的云服务，才是这段旅程最迷人的部分。</p>
<p>这本书的目的，是带领更多的人进入家庭云服务的世界。无论你是电脑爱好者、垃圾佬，还是一个纯粹的极客，我希望通过这本书帮助你一步步搭建出最适合你的家庭云服务，感受到探索和创造的乐趣。</p>
<h1 id="说明" tabindex="-1"><a class="header-anchor" href="#说明"><span>说明</span></a></h1>
<p>为了保留探索与折腾的乐趣，本书将避开飞牛OS等成熟的现成解决方案，而是深入探讨这些服务的本质。从学习基础的公共知识，如Linux操作系统、容器化技术和网络原理，到实际利用容器化技术简化复杂软件的设置，我们将一步步快速搭建属于自己的云服务。那么，让我们从这里开始吧！</p>
</div></template>


